
## Plan Result (v3-proxy-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/66098)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:13" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ healthCheck            = {
                      ~ command     = [
                            "CMD-SHELL",
                          - "curl -f http://localhost:4029/.well-known/server-health || exit 1",
                          + "curl -f http://localhost:4030/.well-known/server-health || exit 1",
                        ]
                        # (4 unchanged attributes hidden)
                    }
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          ~ containerPort = 4029 -> 4030
                          ~ hostPort      = 4029 -> 4030
                          - protocol      = "tcp"
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "V3ProxyApi-Prod" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be updated in-place
  ~ resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-014398a6a95e77b46"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "required"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0149a253bfa33b594",
                ]
              - self             = false
              - to_port          = 4029
            },
          + {
              + cidr_blocks      = []
              + description      = "required"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0149a253bfa33b594",
                ]
              + self             = false
              + to_port          = 4030
            },
        ]
        name                   = "V3ProxyApi-Prod-ECSSecurityGroup2023021323181927290000000c"
        tags                   = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (8 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"91913e60-c3e1-4d73-9628-87d5d225541d","JobName":"v3-proxy-api_infrastructure_plan_prod","PRNumber":231,"Program":"tfcmt","SHA1":"cb41d26473667e0744859fec92db85aad01b0786","Target":"v3-proxy-api-cdk","Vars":{}} -->